meeting/minutes/2026/06-02.org
:PROPERTIES:
:ID:       D0077B23-9D7E-4301-9952-9C194B37DBE9
:END:
#+title: QT4 CG Meeting 167 Minutes 2026-06-02
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Meeting index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

#+TOC: headlines 6

* Summary of new and continuing actions [1/11]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [X] QT4CG-165-02: NW to draft an agenda for the face-to-face meeting
+ [ ] QT4CG-167-01: DB to write a PR for #2641, comments in CSV
+ [ ] QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid
+ [ ] QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string
+ [ ] QT4CG-167-04: NW to make a PR explaining load-xquery-module for PR #2464
+ [ ] QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes
+ [ ] QT4CG-167-06: NW to write a PR to resolve #2169 per GuntherRademacher
+ [ ] QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind
+ [ ] QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.
+ [ ] QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed

* Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

Approved [[../2026/06-16.html][at meeting 168]] on 16 June 2026.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [5/10]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: RD, CG, JK, JWL, WP

+ [X] David J Birnbaum (DB)
+ [ ] Reece Dunn (RD)
+ [ ] Christian Grün (CG)
+ [ ] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK)
+ [X] Juri Leino (JLO)
+ [ ] John Lumley (JWL)
+ [X] Alan Painter (AP)
+ [ ] Wendell Piez (WP)
+ [X] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW) /Scribe/. /Chair/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2026/06-02.html][the agenda]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

Perhaps tomorrow, and then 16 June. Meeting of 9 June is canceled.

CG gives regrets for 2, 9, and 16 June.

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: h-86AD16BA-EA8C-45AB-9900-A18F9BDD8AAA
:END:

** Review of issues
:PROPERTIES:
:CUSTOM_ID: issues
:END:

*** Issue #2660: `fn:matching-segments`: named capture groups
:PROPERTIES:
:CUSTOM_ID: iss-2660
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2660][issue 2660]]

Assigned to CG.

A fair bit of work, but not technically difficult.

*** Issue #2653: FLWOR, member/key/value clauses: allow sequences
:PROPERTIES:
:CUSTOM_ID: iss-2653
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2653][issue 2653]]

+ MK: I’m uneasy. This feels like something that should be done explicitly.
+ JLO: This is what I would expect.
+ MK: Allowing empty sequence might be reasonable.
+ DB: There are other places where we might have sequences of maps and arrays?
  Why is this only in FLWOR expressions?
+ JLO: There’s an implicit merging that I don’t like. I was thinking more of the lookup operator.

There’s reluctance here, but we’ll leave it open and wait to see if a PR is forthcoming.

