meeting/minutes/2026/06-02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 167 Minutes 2026-06-02</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 167 Minutes 2026-06-02</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[1/11]</code></a></li>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[5/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
</ul>
</li>
<li><a href="#h-86AD16BA-EA8C-45AB-9900-A18F9BDD8AAA">2. Technical agenda</a>
<ul>
<li><a href="#issues">2.1. Review of issues</a>
<ul>
<li><a href="#iss-2660">2.1.1. Issue #2660: `fn:matching-segments`: named capture groups</a></li>
<li><a href="#iss-2653">2.1.2. Issue #2653: FLWOR, member/key/value clauses: allow sequences</a></li>
<li><a href="#iss-2644">2.1.3. Issue #2644: Coercing a map to a record type</a></li>
<li><a href="#iss-2567">2.1.4. Issue #2567: Allow one named record type to extend another</a></li>
<li><a href="#iss-2641">2.1.5. Issue #2641: [Feature] Comments and parse-csv()</a></li>
<li><a href="#iss-2615">2.1.6. Issue #2615: XSLT: should xsl:map-entry return a JNode?</a></li>
<li><a href="#iss-2600">2.1.7. Issue #2600: Add options record as second parameter to `fn:collection` and `fn:uri-collection`</a></li>
<li><a href="#iss-2591">2.1.8. Issue #2591: Grammar: step?lookup is currently invalid</a></li>
<li><a href="#iss-2588">2.1.9. Issue #2588: Reintroduce xsl:record</a></li>
<li><a href="#iss-2581">2.1.10. Issue #2581: XSLT Match patterns for GNodes</a></li>
<li><a href="#iss-2576">2.1.11. Issue #2576: parse-json() option to match record types</a></li>
<li><a href="#iss-2521">2.1.12. Issue #2521: File retrieval, URIs: fragment identifiers</a></li>
<li><a href="#iss-2518">2.1.13. Issue #2518: Type Safety</a></li>
<li><a href="#iss-2482">2.1.14. Issue #2482: Add a fallback function to the `bin:decode-string` function</a></li>
<li><a href="#iss-2464">2.1.15. Issue #2464: add method to use path()</a></li>
<li><a href="#iss-2393">2.1.16. Issue #2393: Keep or drop array:members and array:of-members</a></li>
<li><a href="#iss-2390">2.1.17. Issue #2390: methods and inheritance</a></li>
<li><a href="#iss-2257">2.1.18. Issue #2257: Record declarations without namespace</a></li>
<li><a href="#iss-2219">2.1.19. Issue #2219: Generalize method calls to sequences</a></li>
<li><a href="#iss-2169">2.1.20. Issue #2169: Longest-token rule incorrectly produces <code>StringInterpolation</code> delimiter</a></li>
<li><a href="#iss-2073">2.1.21. Issue #2073: JNodes and sequences</a></li>
<li><a href="#iss-2039">2.1.22. Issue #2039: Generalize context item to context value in XSLT</a></li>
<li><a href="#iss-1949">2.1.23. Issue #1949: fn:element-to-map: Updated Feedback</a></li>
<li><a href="#iss-1777">2.1.24. Issue #1777: Shallow copy in XSLT with maps and arrays</a></li>
<li><a href="#iss-1234">2.1.25. Issue #1234: Serialization Parameters: Indentation, Whitespace, Newlines</a></li>
<li><a href="#iss-675">2.1.26. Issue #675: XSLT streaming rules for new constructs</a></li>
<li><a href="#iss-285">2.1.27. Issue #285: Stability of collections</a></li>
</ul>
</li>
<li><a href="#json-transform">2.2. JSON transformations</a></li>
<li><a href="#trusted-execution">2.3. Trusted execution</a>
<ul>
<li><a href="#h-230E9F5B-920C-47AC-AE46-92BB58E8A18C">2.3.1. Where is “trusted” needed?</a></li>
</ul>
</li>
<li><a href="#pub-schedule">2.4. Publication scheduling</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[1/11]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="on"><code>[X]</code> QT4CG-165-02: NW to draft an agenda for the face-to-face meeting</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-01: DB to write a PR for #2641, comments in CSV</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-04: NW to make a PR explaining load-xquery-module for PR #2464</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-06: NW to write a PR to resolve #2169 per GuntherRademacher</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[5/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: RD, CG, JK, JWL, WP
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="off"><code>[&#xa0;]</code> Christian Grün (CG)</li>
<li class="off"><code>[&#xa0;]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="off"><code>[&#xa0;]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Alan Painter (AP)</li>
<li class="off"><code>[&#xa0;]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/06-02.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
Perhaps tomorrow, and then 16 June. Meeting of 9 June is canceled.
</p>

<p>
CG gives regrets for 2, 9, and 16 June.
</p>
</div>
</div>
</div>
<div id="outline-container-h-86AD16BA-EA8C-45AB-9900-A18F9BDD8AAA" class="outline-2">
<h2 id="h-86AD16BA-EA8C-45AB-9900-A18F9BDD8AAA"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-h-86AD16BA-EA8C-45AB-9900-A18F9BDD8AAA">
</div>
<div id="outline-container-issues" class="outline-3">
<h3 id="issues"><span class="section-number-3">2.1.</span> Review of issues</h3>
<div class="outline-text-3" id="text-issues">
</div>
<div id="outline-container-iss-2660" class="outline-4">
<h4 id="iss-2660"><span class="section-number-4">2.1.1.</span> Issue #2660: `fn:matching-segments`: named capture groups</h4>
<div class="outline-text-4" id="text-iss-2660">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2660">issue 2660</a>
</p>

<p>
Assigned to CG.
</p>

<p>
A fair bit of work, but not technically difficult.
</p>
</div>
</div>
<div id="outline-container-iss-2653" class="outline-4">
<h4 id="iss-2653"><span class="section-number-4">2.1.2.</span> Issue #2653: FLWOR, member/key/value clauses: allow sequences</h4>
<div class="outline-text-4" id="text-iss-2653">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2653">issue 2653</a>
</p>

<ul class="org-ul">
<li>MK: I’m uneasy. This feels like something that should be done explicitly.</li>
<li>JLO: This is what I would expect.</li>
<li>MK: Allowing empty sequence might be reasonable.</li>
<li>DB: There are other places where we might have sequences of maps and arrays?
Why is this only in FLWOR expressions?</li>
<li>JLO: There’s an implicit merging that I don’t like. I was thinking more of the lookup operator.</li>
</ul>

<p>
There’s reluctance here, but we’ll leave it open and wait to see if a PR is forthcoming.
</p>
</div>
</div>
