meeting/minutes/2026/06-02.org
*** Issue #2644: Coercing a map to a record type
:PROPERTIES:
:CUSTOM_ID: iss-2644
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2644][issue 2644]]

+ MK: I can see the argument for wanting to detect errors. But there’s no easy way to drop the unwanted fields.
+ NW: Can we have a function for that?
+ MK: Types aren’t values, so no. We could have a “castable something” kind of expression,.
  + … If we think the feature is important enough to justify new syntax.

Consensus in the comments seems to settle on extending ~cast as~ expressions.

+ BTW: Would it be possible to make it such that if the supplied value is a
  superset of the field names from the record type. 
+ MK: One of the problem is that this interacts with other things; for example the issue about subtyping record types.
  + … If a subtype was defined, then it would be safe to ignore the extra fields
    because you’ve declared it explicitly.

Let’s consider that issue for a moment…

Defer discussion of #2644 until after we’ve resolved #2567, below.

*** Issue #2567: Allow one named record type to extend another
:PROPERTIES:
:CUSTOM_ID: iss-2567
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2567][issue 2567]]

+ MK: This is all related to changing to using the names of record types.
+ MK: I have a PR in progress for this, but I’m not happy with it.
+ NW: Are you confident we’ll get there?
+ MK: I think so. The main issue is how much of the current functionality you drop.
  + … There’s a lot of capability for loose typing with maps; do you move to
    something much more strict for records, or do you try to preserve some of the looseness.
+ JLO: Don’t the type annotations mean we have to be strict?
+ MK: One of the issues is anonymous record types; can you annotate an anonymous record with a type?
  + … What then does it mean for them to be the same?
  + … There are also complexities related to recursiveness. If you say a named record type is just an alias,
    then recursive types become infinite.
  + … Some of the academic literature on typing says you conceptually expand it and compare two infinite definitions.
  + … Let’s avoid that!
  + … The other way is that they’re only equivalent if they use the same type name.
+ JLO: Then two anonymous records can never equal?
+ MK: Right. There are a lot of questions about anonymous record types.
+ JLO: What’s the use case for anonymous record types?
+ MK: We could get rid of them. It’s sometimes inconvenient to have to name a record type.

Some discussion of the use of an anonymous record type as a function argument.

+ MK: We could say that anonymous record types have an unknowable name.
+ MK: Parsing a JSON tree gives you maps at the moment; if you want to select
  maps based on their content, like the pattern syntax in XSLT, when we had
  extensible records you could do that. But we’ve lost that now and we don’t
  really have a substitute.
+ JLO: So there’s no way?
+ MK: You can do it with a complex predicate, but there’s no convenient way.

*** Issue #2641: [Feature] Comments and parse-csv()
:PROPERTIES:
:CUSTOM_ID: iss-2641
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2641][issue 2641]]

+ DB: This seems low cost and useful.
+ MK: How does this relate to blank lines?
+ NW: Blank lines are skipped?
+ MK: No, there’s an arbitrary rule about what it gives you; I think it gives
  you a record containing a single empty field.

ACTION QT4CG-167-01: DB to write a PR for #2641, comments in CSV

*** Issue #2615: XSLT: should xsl:map-entry return a JNode?
:PROPERTIES:
:CUSTOM_ID: iss-2615
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2615][issue 2615]]

+ MK: Can we make ~xsl:map-entry~ more consistent with ~xsl:array~?
  + “Maybe.”

No progress; but we need to do the work.

*** Issue #2600: Add options record as second parameter to `fn:collection` and `fn:uri-collection`
:PROPERTIES:
:CUSTOM_ID: iss-2600
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2600][issue 2600]]

+ JLO: I’m working on a PR, but it isn’t ready yet.
+ MK: Do we want to make collections a bit less abstract? Do we want to define
  mappings from abstract collections to directories or zip archives?
+ JLO: I would like to keep it abstract; in the database context “collections” are something else.
  + … My main concern is do we have to have a mechanism to define those mappings in the options map,
    or can we leave it implementation defined.
+ MK: Do we introduce a concept of media type?
+ JLO: Not yet. The original spec is just undefined, it says use a mapping if it exists.
+ MK: So you don’t want the map to say?
+ NW: Letting users setup the mapping themselves would have some value.

Some discussions of various aspects of media types and filesystem metadata.

+ JLO: This is a complex problem; some type of media type mapping would be okay.
+ MK: I’d be inclined to allow the options to define a mapping table and it’s implementation defined if you don’t.
+ JLO: Then there’s the parser question. Do we define a mapping from media type to parser?
  + … This is where I’m struggling at the moment!
+ MK: You could make it a mapping from file extension to media type and then from media type to parsing function.
+ MK: Mapping to a parsing function would allow you to move the complexities of
  options to the parser out of the collection options.
  + … But what is the signature of that function? Pass a binary?

JLO will continue to develop the PR.

*** Issue #2591: Grammar: step?lookup is currently invalid
:PROPERTIES:
:CUSTOM_ID: iss-2591
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2591][issue 2591]]

Some discussion about the fact that the grammar has changed and some of the
nonterminals described in the issue are now gone.

+ NW: Are we inclined to fix this?
+ MK: I think so.
+ JLO: Would ~(a/b)?x~ work? If it would, maybe we don’t want to fix this?
+ MK: ~a/b/x~ will return a JNode rather than the value from the map
+ JLO: So what’s desired here is an implicit call to ~fn:jvalue~.
+ MK: Yep.

ACTION QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid

+ JLO: The parenthesized version works, and I still prefer that.

*** Issue #2588: Reintroduce xsl:record
:PROPERTIES:
:CUSTOM_ID: iss-2588
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2588][issue 2588]]

+ MK: Let’s leave this until we’ve sorted out other things; it’s only syntactic sugar.

