meeting/minutes/2026/06-02.html
<div id="outline-container-iss-2644" class="outline-4">
<h4 id="iss-2644"><span class="section-number-4">2.1.3.</span> Issue #2644: Coercing a map to a record type</h4>
<div class="outline-text-4" id="text-iss-2644">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2644">issue 2644</a>
</p>

<ul class="org-ul">
<li>MK: I can see the argument for wanting to detect errors. But there’s no easy way to drop the unwanted fields.</li>
<li>NW: Can we have a function for that?</li>
<li>MK: Types aren’t values, so no. We could have a “castable something” kind of expression,.
<ul class="org-ul">
<li>… If we think the feature is important enough to justify new syntax.</li>
</ul></li>
</ul>

<p>
Consensus in the comments seems to settle on extending <code>cast as</code> expressions.
</p>

<ul class="org-ul">
<li>BTW: Would it be possible to make it such that if the supplied value is a
superset of the field names from the record type.</li>
<li>MK: One of the problem is that this interacts with other things; for example the issue about subtyping record types.
<ul class="org-ul">
<li>… If a subtype was defined, then it would be safe to ignore the extra fields
because you’ve declared it explicitly.</li>
</ul></li>
</ul>

<p>
Let’s consider that issue for a moment…
</p>

<p>
Defer discussion of #2644 until after we’ve resolved #2567, below.
</p>
</div>
</div>
<div id="outline-container-iss-2567" class="outline-4">
<h4 id="iss-2567"><span class="section-number-4">2.1.4.</span> Issue #2567: Allow one named record type to extend another</h4>
<div class="outline-text-4" id="text-iss-2567">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2567">issue 2567</a>
</p>

<ul class="org-ul">
<li>MK: This is all related to changing to using the names of record types.</li>
<li>MK: I have a PR in progress for this, but I’m not happy with it.</li>
<li>NW: Are you confident we’ll get there?</li>
<li>MK: I think so. The main issue is how much of the current functionality you drop.
<ul class="org-ul">
<li>… There’s a lot of capability for loose typing with maps; do you move to
something much more strict for records, or do you try to preserve some of the looseness.</li>
</ul></li>
<li>JLO: Don’t the type annotations mean we have to be strict?</li>
<li>MK: One of the issues is anonymous record types; can you annotate an anonymous record with a type?
<ul class="org-ul">
<li>… What then does it mean for them to be the same?</li>
<li>… There are also complexities related to recursiveness. If you say a named record type is just an alias,
then recursive types become infinite.</li>
<li>… Some of the academic literature on typing says you conceptually expand it and compare two infinite definitions.</li>
<li>… Let’s avoid that!</li>
<li>… The other way is that they’re only equivalent if they use the same type name.</li>
</ul></li>
<li>JLO: Then two anonymous records can never equal?</li>
<li>MK: Right. There are a lot of questions about anonymous record types.</li>
<li>JLO: What’s the use case for anonymous record types?</li>
<li>MK: We could get rid of them. It’s sometimes inconvenient to have to name a record type.</li>
</ul>

<p>
Some discussion of the use of an anonymous record type as a function argument.
</p>

<ul class="org-ul">
<li>MK: We could say that anonymous record types have an unknowable name.</li>
<li>MK: Parsing a JSON tree gives you maps at the moment; if you want to select
maps based on their content, like the pattern syntax in XSLT, when we had
extensible records you could do that. But we’ve lost that now and we don’t
really have a substitute.</li>
<li>JLO: So there’s no way?</li>
<li>MK: You can do it with a complex predicate, but there’s no convenient way.</li>
</ul>
</div>
</div>
<div id="outline-container-iss-2641" class="outline-4">
<h4 id="iss-2641"><span class="section-number-4">2.1.5.</span> Issue #2641: [Feature] Comments and parse-csv()</h4>
<div class="outline-text-4" id="text-iss-2641">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2641">issue 2641</a>
</p>

<ul class="org-ul">
<li>DB: This seems low cost and useful.</li>
<li>MK: How does this relate to blank lines?</li>
<li>NW: Blank lines are skipped?</li>
<li>MK: No, there’s an arbitrary rule about what it gives you; I think it gives
you a record containing a single empty field.</li>
</ul>

<p>
ACTION QT4CG-167-01: DB to write a PR for #2641, comments in CSV
</p>
</div>
</div>
<div id="outline-container-iss-2615" class="outline-4">
<h4 id="iss-2615"><span class="section-number-4">2.1.6.</span> Issue #2615: XSLT: should xsl:map-entry return a JNode?</h4>
<div class="outline-text-4" id="text-iss-2615">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2615">issue 2615</a>
</p>

<ul class="org-ul">
<li>MK: Can we make <code>xsl:map-entry</code> more consistent with <code>xsl:array</code>?
<ul class="org-ul">
<li>“Maybe.”</li>
</ul></li>
</ul>

<p>
No progress; but we need to do the work.
</p>
</div>
</div>
<div id="outline-container-iss-2600" class="outline-4">
<h4 id="iss-2600"><span class="section-number-4">2.1.7.</span> Issue #2600: Add options record as second parameter to `fn:collection` and `fn:uri-collection`</h4>
<div class="outline-text-4" id="text-iss-2600">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2600">issue 2600</a>
</p>

<ul class="org-ul">
<li>JLO: I’m working on a PR, but it isn’t ready yet.</li>
<li>MK: Do we want to make collections a bit less abstract? Do we want to define
mappings from abstract collections to directories or zip archives?</li>
<li>JLO: I would like to keep it abstract; in the database context “collections” are something else.
<ul class="org-ul">
<li>… My main concern is do we have to have a mechanism to define those mappings in the options map,
or can we leave it implementation defined.</li>
</ul></li>
<li>MK: Do we introduce a concept of media type?</li>
<li>JLO: Not yet. The original spec is just undefined, it says use a mapping if it exists.</li>
<li>MK: So you don’t want the map to say?</li>
<li>NW: Letting users setup the mapping themselves would have some value.</li>
</ul>

<p>
Some discussions of various aspects of media types and filesystem metadata.
</p>

<ul class="org-ul">
<li>JLO: This is a complex problem; some type of media type mapping would be okay.</li>
<li>MK: I’d be inclined to allow the options to define a mapping table and it’s implementation defined if you don’t.</li>
<li>JLO: Then there’s the parser question. Do we define a mapping from media type to parser?
<ul class="org-ul">
<li>… This is where I’m struggling at the moment!</li>
</ul></li>
<li>MK: You could make it a mapping from file extension to media type and then from media type to parsing function.</li>
<li>MK: Mapping to a parsing function would allow you to move the complexities of
options to the parser out of the collection options.
<ul class="org-ul">
<li>… But what is the signature of that function? Pass a binary?</li>
</ul></li>
</ul>

<p>
JLO will continue to develop the PR.
</p>
</div>
</div>
<div id="outline-container-iss-2591" class="outline-4">
<h4 id="iss-2591"><span class="section-number-4">2.1.8.</span> Issue #2591: Grammar: step?lookup is currently invalid</h4>
<div class="outline-text-4" id="text-iss-2591">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2591">issue 2591</a>
</p>

<p>
Some discussion about the fact that the grammar has changed and some of the
nonterminals described in the issue are now gone.
</p>

<ul class="org-ul">
<li>NW: Are we inclined to fix this?</li>
<li>MK: I think so.</li>
<li>JLO: Would <code>(a/b)?x</code> work? If it would, maybe we don’t want to fix this?</li>
<li>MK: <code>a/b/x</code> will return a JNode rather than the value from the map</li>
<li>JLO: So what’s desired here is an implicit call to <code>fn:jvalue</code>.</li>
<li>MK: Yep.</li>
</ul>

<p>
ACTION QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid
</p>

<ul class="org-ul">
<li>JLO: The parenthesized version works, and I still prefer that.</li>
</ul>
</div>
</div>
<div id="outline-container-iss-2588" class="outline-4">
<h4 id="iss-2588"><span class="section-number-4">2.1.9.</span> Issue #2588: Reintroduce xsl:record</h4>
<div class="outline-text-4" id="text-iss-2588">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2588">issue 2588</a>
</p>

<ul class="org-ul">
<li>MK: Let’s leave this until we’ve sorted out other things; it’s only syntactic sugar.</li>
</ul>
</div>
</div>
