meeting/minutes/2026/06-02.org
*** Issue #2581: XSLT Match patterns for GNodes
:PROPERTIES:
:CUSTOM_ID: iss-2581
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2581][issue 2581]]

+ MK: The debate is what we want the endpoint to be. In particular, do we want
  traditional style match patterns of the form ~a/b/c~ to match JNodes in JTrees?
  + … I think I’ve been swayed a little bit by implementation convenience.
  + … It’s useful to know what kind of thing is going to be matched and we’d lose that.
  + … So I’m slightly torn. Also, from a user point of view, it’s useful to be
    able to look at the code and know what it’s going to match.
  + … So there’s both an implementation and usability argument for making the
    patterns distinct.
+ DB: It seems to be a consequence of making them nodes.
+ JLO: Not doing this requires a different form of pattern match.
+ MK: Yes, and we’ve introduced the new syntax for matching maps.
+ NW: I’m persuaded by the usability issue.
+ MK: There’s a differents in XPath and XQuery. In XQuery, ~a/b/c~ often appears
  in a context where you can see what it’s doing. But a match pattern in a
  template rule is much more context free.
  + … In XQuery, ~$map/a/b/c~, you can tell that ~$map~ is a map.
  + … But template rules are much more stand alone.

Some discussion of the current problem, including enclosed modes.

+ JLO: In XQuery there will be places where it will happen.
+ MK: It will happen, not everyone declares the type of their parameters.

MK observes that you have to use predicates to go upwards if you separate them.

MK to continue working on it.

*** Issue #2576: parse-json() option to match record types
:PROPERTIES:
:CUSTOM_ID: iss-2576
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2576][issue 2576]]

+ MK: Maps often come from parsing JSON, an opportunity to turn them into records would be useful.

Some discussion of possible consequences.

+ JLO: Doesn’t this make the parsing non-streamable?
+ MK: Yes, but it’s already not fully streamable because of duplicate key checking.

Consensus: this is a good idea.

*** Issue #2521: File retrieval, URIs: fragment identifiers
:PROPERTIES:
:CUSTOM_ID: iss-2521
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2521][issue 2521]]

+ NW: Simplifying the error codes seems reasonable.
+ MK: I agree. They’re a mess.
+ NW: What do folks think of allowing fragment identifiers more generally?
+ JLO: I like them. But I think they should also be allowed as an option.
  + … I say no to fragment identifers in the URI, but yes to allowing them in the options.
+ NW: “Ugh.”

Presumably this is for all the parsing functions that take URIs.

+ MK: The ~doc~ function already has a lot of trouble because most parsers don’t
  report ID attributes.
  + … And if the input comes from a DOM or something, it tends to have been lost.

+ NW: We need to explain why it’s only on the ~fn:doc~ function or allow it everywhere.

*** Issue #2518: Type Safety
:PROPERTIES:
:CUSTOM_ID: iss-2518
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2518][issue 2518]]

+ MK: If you use the lookup operator on a record, you get an error if the record type doesn’t define what you’re looking for.
  + … I think that’s probably the best we can do.
+ NW: Propose close with no further action?

Done.

*** Issue #2482: Add a fallback function to the `bin:decode-string` function
:PROPERTIES:
:CUSTOM_ID: iss-2482
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2482][issue 2482]]

+ NW: Do folks agree we should add a fallback function?

Some discussion of what you could pass to the fallback function. If you can’t
decode the input, it isn’t properly a code point, but it also isn’t necessarily
a single octet.

+ MK: Related: what’s actually feasible if you’re not hand decoding it.

+ NW: I propose we mark this “nice to have” and see if NW produces a PR.

ACTION QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string

*** Issue #2464: add method to use path()
:PROPERTIES:
:CUSTOM_ID: iss-2464
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2464][issue 2464]]

+ MK: Defining a function that accepts only the subset of XPath returned by
  ~fn:path~ is hard work and of little value.
+ MK: There’s a generic solution using load-xqery-module…

Proposal: give an example of how to use load-xquery-module to achieve the effect.

ACTION QT4CG-167-04: NW to make a PR explaining load-xquery-module for PR #2464

*** Issue #2393: Keep or drop array:members and array:of-members
:PROPERTIES:
:CUSTOM_ID: iss-2393
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2393][issue 2393]]

+ MK: The introduction of JNodes have changed the equation here a bit.
  + … You could define array members to evaluate the child axis to return JNodes
  + … We could have a ~children~ function and it would be similar to that. (We do have ~siblings~)

Proposal: recast the functions as returning JNodes.

ACTION QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes

*** Issue #2390: methods and inheritance
:PROPERTIES:
:CUSTOM_ID: iss-2390
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2390][issue 2390]]

+ MK: The comment I made 30 May is related; we could allow maps to be ~%frozen~.
  + … Doing a map:put or map:get, you either get an error or it creates a new
    map, it doesn’t give you another instance of the same type.

Some discussion of “frozen” vs “immutable” vs “persistent”…

Leave until/add to the question of extensible record types.

*** Issue #2257: Record declarations without namespace
:PROPERTIES:
:CUSTOM_ID: iss-2257
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2257][issue 2257]]

+ MK: The big issue here is different default namespaces for functions and types.
  + … A record type acts as both function name and a type name; if the defaults
    are different, you get into an awful mess.

Leave open, CG has indicated he wants to try a PR.

*** Issue #2219: Generalize method calls to sequences
:PROPERTIES:
:CUSTOM_ID: iss-2219
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2219][issue 2219]]

+ MK: There are two parts and we did one part. If the left hand side selects
  multiple maps, we apply the method to each one.
  + … What we haven’t done is allow the right hand side to select multiple methods.

History is complicatd on this. There’s a valid consistency argument. We need a PR.

