meeting/minutes/2026/06-02.html
<div id="outline-container-iss-2581" class="outline-4">
<h4 id="iss-2581"><span class="section-number-4">2.1.10.</span> Issue #2581: XSLT Match patterns for GNodes</h4>
<div class="outline-text-4" id="text-iss-2581">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2581">issue 2581</a>
</p>

<ul class="org-ul">
<li>MK: The debate is what we want the endpoint to be. In particular, do we want
traditional style match patterns of the form <code>a/b/c</code> to match JNodes in JTrees?
<ul class="org-ul">
<li>… I think I’ve been swayed a little bit by implementation convenience.</li>
<li>… It’s useful to know what kind of thing is going to be matched and we’d lose that.</li>
<li>… So I’m slightly torn. Also, from a user point of view, it’s useful to be
able to look at the code and know what it’s going to match.</li>
<li>… So there’s both an implementation and usability argument for making the
patterns distinct.</li>
</ul></li>
<li>DB: It seems to be a consequence of making them nodes.</li>
<li>JLO: Not doing this requires a different form of pattern match.</li>
<li>MK: Yes, and we’ve introduced the new syntax for matching maps.</li>
<li>NW: I’m persuaded by the usability issue.</li>
<li>MK: There’s a differents in XPath and XQuery. In XQuery, <code>a/b/c</code> often appears
in a context where you can see what it’s doing. But a match pattern in a
template rule is much more context free.
<ul class="org-ul">
<li>… In XQuery, <code>$map/a/b/c</code>, you can tell that <code>$map</code> is a map.</li>
<li>… But template rules are much more stand alone.</li>
</ul></li>
</ul>

<p>
Some discussion of the current problem, including enclosed modes.
</p>

<ul class="org-ul">
<li>JLO: In XQuery there will be places where it will happen.</li>
<li>MK: It will happen, not everyone declares the type of their parameters.</li>
</ul>

<p>
MK observes that you have to use predicates to go upwards if you separate them.
</p>

<p>
MK to continue working on it.
</p>
</div>
</div>
<div id="outline-container-iss-2576" class="outline-4">
<h4 id="iss-2576"><span class="section-number-4">2.1.11.</span> Issue #2576: parse-json() option to match record types</h4>
<div class="outline-text-4" id="text-iss-2576">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2576">issue 2576</a>
</p>

<ul class="org-ul">
<li>MK: Maps often come from parsing JSON, an opportunity to turn them into records would be useful.</li>
</ul>

<p>
Some discussion of possible consequences.
</p>

<ul class="org-ul">
<li>JLO: Doesn’t this make the parsing non-streamable?</li>
<li>MK: Yes, but it’s already not fully streamable because of duplicate key checking.</li>
</ul>

<p>
Consensus: this is a good idea.
</p>
</div>
</div>
<div id="outline-container-iss-2521" class="outline-4">
<h4 id="iss-2521"><span class="section-number-4">2.1.12.</span> Issue #2521: File retrieval, URIs: fragment identifiers</h4>
<div class="outline-text-4" id="text-iss-2521">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2521">issue 2521</a>
</p>

<ul class="org-ul">
<li>NW: Simplifying the error codes seems reasonable.</li>
<li>MK: I agree. They’re a mess.</li>
<li>NW: What do folks think of allowing fragment identifiers more generally?</li>
<li>JLO: I like them. But I think they should also be allowed as an option.
<ul class="org-ul">
<li>… I say no to fragment identifers in the URI, but yes to allowing them in the options.</li>
</ul></li>
<li>NW: “Ugh.”</li>
</ul>

<p>
Presumably this is for all the parsing functions that take URIs.
</p>

<ul class="org-ul">
<li>MK: The <code>doc</code> function already has a lot of trouble because most parsers don’t
report ID attributes.
<ul class="org-ul">
<li>… And if the input comes from a DOM or something, it tends to have been lost.</li>
</ul></li>

<li>NW: We need to explain why it’s only on the <code>fn:doc</code> function or allow it everywhere.</li>
</ul>
</div>
</div>
<div id="outline-container-iss-2518" class="outline-4">
<h4 id="iss-2518"><span class="section-number-4">2.1.13.</span> Issue #2518: Type Safety</h4>
<div class="outline-text-4" id="text-iss-2518">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2518">issue 2518</a>
</p>

<ul class="org-ul">
<li>MK: If you use the lookup operator on a record, you get an error if the record type doesn’t define what you’re looking for.
<ul class="org-ul">
<li>… I think that’s probably the best we can do.</li>
</ul></li>
<li>NW: Propose close with no further action?</li>
</ul>

<p>
Done.
</p>
</div>
</div>
<div id="outline-container-iss-2482" class="outline-4">
<h4 id="iss-2482"><span class="section-number-4">2.1.14.</span> Issue #2482: Add a fallback function to the `bin:decode-string` function</h4>
<div class="outline-text-4" id="text-iss-2482">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2482">issue 2482</a>
</p>

<ul class="org-ul">
<li>NW: Do folks agree we should add a fallback function?</li>
</ul>

<p>
Some discussion of what you could pass to the fallback function. If you can’t
decode the input, it isn’t properly a code point, but it also isn’t necessarily
a single octet.
</p>

<ul class="org-ul">
<li>MK: Related: what’s actually feasible if you’re not hand decoding it.</li>

<li>NW: I propose we mark this “nice to have” and see if NW produces a PR.</li>
</ul>

<p>
ACTION QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string
</p>
</div>
</div>
<div id="outline-container-iss-2464" class="outline-4">
<h4 id="iss-2464"><span class="section-number-4">2.1.15.</span> Issue #2464: add method to use path()</h4>
<div class="outline-text-4" id="text-iss-2464">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2464">issue 2464</a>
</p>

<ul class="org-ul">
<li>MK: Defining a function that accepts only the subset of XPath returned by
<code>fn:path</code> is hard work and of little value.</li>
<li>MK: There’s a generic solution using load-xqery-module…</li>
</ul>

<p>
Proposal: give an example of how to use load-xquery-module to achieve the effect.
</p>

<p>
ACTION QT4CG-167-04: NW to make a PR explaining load-xquery-module for PR #2464
</p>
</div>
</div>
<div id="outline-container-iss-2393" class="outline-4">
<h4 id="iss-2393"><span class="section-number-4">2.1.16.</span> Issue #2393: Keep or drop array:members and array:of-members</h4>
<div class="outline-text-4" id="text-iss-2393">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2393">issue 2393</a>
</p>

<ul class="org-ul">
<li>MK: The introduction of JNodes have changed the equation here a bit.
<ul class="org-ul">
<li>… You could define array members to evaluate the child axis to return JNodes</li>
<li>… We could have a <code>children</code> function and it would be similar to that. (We do have <code>siblings</code>)</li>
</ul></li>
</ul>

<p>
Proposal: recast the functions as returning JNodes.
</p>

<p>
ACTION QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes
</p>
</div>
</div>
<div id="outline-container-iss-2390" class="outline-4">
<h4 id="iss-2390"><span class="section-number-4">2.1.17.</span> Issue #2390: methods and inheritance</h4>
<div class="outline-text-4" id="text-iss-2390">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2390">issue 2390</a>
</p>

<ul class="org-ul">
<li>MK: The comment I made 30 May is related; we could allow maps to be <code>%frozen</code>.
<ul class="org-ul">
<li>… Doing a map:put or map:get, you either get an error or it creates a new
map, it doesn’t give you another instance of the same type.</li>
</ul></li>
</ul>

<p>
Some discussion of “frozen” vs “immutable” vs “persistent”…
</p>

<p>
Leave until/add to the question of extensible record types.
</p>
</div>
</div>
<div id="outline-container-iss-2257" class="outline-4">
<h4 id="iss-2257"><span class="section-number-4">2.1.18.</span> Issue #2257: Record declarations without namespace</h4>
<div class="outline-text-4" id="text-iss-2257">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2257">issue 2257</a>
</p>

<ul class="org-ul">
<li>MK: The big issue here is different default namespaces for functions and types.
<ul class="org-ul">
<li>… A record type acts as both function name and a type name; if the defaults
are different, you get into an awful mess.</li>
</ul></li>
</ul>

<p>
Leave open, CG has indicated he wants to try a PR.
</p>
</div>
</div>
<div id="outline-container-iss-2219" class="outline-4">
<h4 id="iss-2219"><span class="section-number-4">2.1.19.</span> Issue #2219: Generalize method calls to sequences</h4>
<div class="outline-text-4" id="text-iss-2219">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2219">issue 2219</a>
</p>

<ul class="org-ul">
<li>MK: There are two parts and we did one part. If the left hand side selects
multiple maps, we apply the method to each one.
<ul class="org-ul">
<li>… What we haven’t done is allow the right hand side to select multiple methods.</li>
</ul></li>
</ul>

<p>
History is complicatd on this. There’s a valid consistency argument. We need a PR.
</p>
</div>
</div>
