meeting/minutes/2026/06-02.org
*** Issue #2169: Longest-token rule incorrectly produces ~StringInterpolation~ delimiter
:PROPERTIES:
:CUSTOM_ID: iss-2169
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2169][issue 2169]]

Consensus: that probably works. 

+ JLO: It looks the same to me.
+ MK: It’s just a consequence of the tokenization rules.

ACTION QT4CG-167-06: NW to write a PR to resolve #2169 per GuntherRademacher

+ MK: I hesitated because I wondered about edge cases.

ACTION QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind

*** Issue #2073: JNodes and sequences
:PROPERTIES:
:CUSTOM_ID: iss-2073
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2073][issue 2073]]

+ MK: The classic scenario is that you have a map and one of the entries in a
  map has a value that is a sequence that contains two maps.
  + … How many JNodes do you get?
  + … Do you get a single child JNode containing a sequence of two maps, or two
    JNodes each of which is a single map.
+ NW: What does the spec say today?
+ MK: What it says isn’t very approachable.

Looking at the expression in Data Model 8.5 JNodes

#+BEGIN_SRC
$PARENT = JNode( [ ([1], [2], "X"), ([3], [4]) ] )
dm:j-value = [ ([1], [2], "X"), ([3], [4]) ]
(: That item is an array :)
for each member:
  ([1], [2], "X")
  return dm:JNode with that sequence as its jvalue
    [1]
    return dm:JNode with the 1 as its jvalue
    [2]
    return dm:JNode with the 2 as its jvalue
    "X"
    return ()
#+END_SRC

+ NW: That’s certainly not useful…
+ JLO: Wouldn’t  it be better to break it out of a JTree at this point?
+ MK: We could make it an error at this case

Is there an analogy with text nodes? It’s sort of mixe content.

+ MK: Maybe JNodes can have leaf nodes that are treated differently.

Will continue to think about it.

*** Issue #2039: Generalize context item to context value in XSLT
:PROPERTIES:
:CUSTOM_ID: iss-2039
:END:

See [[https://github.com/qt4cg/qtspecs/issues/2039][issue 2039]]

+ MK: I think we can live with the status quo; we have a context value in the
  XPath context but in XSLT, we still have a context item.

There’s a lot of work without a lot of value in making the initial context thing a value.

Proposal: close with no acton.

*** Issue #1949: fn:element-to-map: Updated Feedback
:PROPERTIES:
:CUSTOM_ID: iss-1949
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1949][issue 1949]]

ACTION QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.

*** Issue #1777: Shallow copy in XSLT with maps and arrays
:PROPERTIES:
:CUSTOM_ID: iss-1777
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1777][issue 1777]]

+ MK: In shallow-copy-mode, if you don’t write any template rules, the input is unchanged.
  + … You should be able to write templates that match individual items in the tree.
  + … It should behave as much like the same model with XNodes as possible.

Next on the agenda, see below.

*** Issue #1234: Serialization Parameters: Indentation, Whitespace, Newlines
:PROPERTIES:
:CUSTOM_ID: iss-1234
:END:

See [[https://github.com/qt4cg/qtspecs/issues/1234][issue 1234]]

+ JLO: I like it.
+ MK: We have extension attributes in Saxon to do this.
  + … We do indent attributes by default, but you can switch it off (by setting the line length)
+ DB: I’d like ~line-length~ as well.
+ JLO: I’ve had several users requesting this.
+ MK: An option to reformat paragraphs would also be nice.
+ NW: Let’s leave aside the question “what is a paragraph!”
+ MK: Well, it’s clear in HTML.

We’ll wait to see if CG writes a PR.

*** Issue #675: XSLT streaming rules for new constructs
:PROPERTIES:
:CUSTOM_ID: iss-675
:END:

See [[https://github.com/qt4cg/qtspecs/issues/675:][issue 675:]]

“Yes, we need them.”

+ MK: I’ve done some work on them, but they need reviewing.
  + … And there’s an enormous gap in testing.

Some discussion of the philosophy of streaming.

+ MK: The demand for streaming is down (because hardware is bigger), but the
  2^31 limit on Java and C# strings is becoming problematic. But that’s an
  implementation problem.

*** Issue #285: Stability of collections
:PROPERTIES:
:CUSTOM_ID: iss-285
:END:

See [[https://github.com/qt4cg/qtspecs/issues/285:][issue 285:]]

+ MK: There’s another significant problem with stability: all these functions
  now have options and if you read the same URI with different options, you
  sometimes need to get back a different document.
+ NW: Is it time to consider abandoning the stability requirement altogether?
+ MK: Well, that’s a radical choice. Lots of users call “doc” inside a match
  pattern, so that would be catastrophic.
  + … Saxon ~fn:collection~ has never been stable and no one has ever complained.
+ JLO: Writing into a collection a database would make more documents appear.

Some discussion of hashing the options and doing stability with the URI + the options.

+ MK: That’s what we’re doing with the ~fn:doc~ function.
  + … Then there’s consistency: if you do ~fn:doc~ and ~fn:unparsed-text~ on the
    same URI, do they have to be “consistent”?
+ NW: It boils down to keeping the bag of bits you got from the first access.

+ MK: Stability for the ~fn:doc~ function has two aspects: has the underlying
  resource changed, but also, you are guaranteeing node identity of the
  document. That doesn’t apply to parsing JSON, or other sources.

We have the option on ~fn:doc~ to say whether or not you want guaranteed stability.

Leave open, still unresolved.

