meeting/minutes/2026/06-02.html
<div id="outline-container-iss-2169" class="outline-4">
<h4 id="iss-2169"><span class="section-number-4">2.1.20.</span> Issue #2169: Longest-token rule incorrectly produces <code>StringInterpolation</code> delimiter</h4>
<div class="outline-text-4" id="text-iss-2169">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2169">issue 2169</a>
</p>

<p>
Consensus: that probably works. 
</p>

<ul class="org-ul">
<li>JLO: It looks the same to me.</li>
<li>MK: It’s just a consequence of the tokenization rules.</li>
</ul>

<p>
ACTION QT4CG-167-06: NW to write a PR to resolve #2169 per GuntherRademacher
</p>

<ul class="org-ul">
<li>MK: I hesitated because I wondered about edge cases.</li>
</ul>

<p>
ACTION QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind
</p>
</div>
</div>
<div id="outline-container-iss-2073" class="outline-4">
<h4 id="iss-2073"><span class="section-number-4">2.1.21.</span> Issue #2073: JNodes and sequences</h4>
<div class="outline-text-4" id="text-iss-2073">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2073">issue 2073</a>
</p>

<ul class="org-ul">
<li>MK: The classic scenario is that you have a map and one of the entries in a
map has a value that is a sequence that contains two maps.
<ul class="org-ul">
<li>… How many JNodes do you get?</li>
<li>… Do you get a single child JNode containing a sequence of two maps, or two
JNodes each of which is a single map.</li>
</ul></li>
<li>NW: What does the spec say today?</li>
<li>MK: What it says isn’t very approachable.</li>
</ul>

<p>
Looking at the expression in Data Model 8.5 JNodes
</p>

<div class="org-src-container">
<pre class="src src-nil">$PARENT = JNode( [ ([1], [2], "X"), ([3], [4]) ] )
dm:j-value = [ ([1], [2], "X"), ([3], [4]) ]
(: That item is an array :)
for each member:
  ([1], [2], "X")
  return dm:JNode with that sequence as its jvalue
    [1]
    return dm:JNode with the 1 as its jvalue
    [2]
    return dm:JNode with the 2 as its jvalue
    "X"
    return ()
</pre>
</div>

<ul class="org-ul">
<li>NW: That’s certainly not useful…</li>
<li>JLO: Wouldn’t  it be better to break it out of a JTree at this point?</li>
<li>MK: We could make it an error at this case</li>
</ul>

<p>
Is there an analogy with text nodes? It’s sort of mixe content.
</p>

<ul class="org-ul">
<li>MK: Maybe JNodes can have leaf nodes that are treated differently.</li>
</ul>

<p>
Will continue to think about it.
</p>
</div>
</div>
<div id="outline-container-iss-2039" class="outline-4">
<h4 id="iss-2039"><span class="section-number-4">2.1.22.</span> Issue #2039: Generalize context item to context value in XSLT</h4>
<div class="outline-text-4" id="text-iss-2039">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/2039">issue 2039</a>
</p>

<ul class="org-ul">
<li>MK: I think we can live with the status quo; we have a context value in the
XPath context but in XSLT, we still have a context item.</li>
</ul>

<p>
There’s a lot of work without a lot of value in making the initial context thing a value.
</p>

<p>
Proposal: close with no acton.
</p>
</div>
</div>
<div id="outline-container-iss-1949" class="outline-4">
<h4 id="iss-1949"><span class="section-number-4">2.1.23.</span> Issue #1949: fn:element-to-map: Updated Feedback</h4>
<div class="outline-text-4" id="text-iss-1949">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1949">issue 1949</a>
</p>

<p>
ACTION QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.
</p>
</div>
</div>
<div id="outline-container-iss-1777" class="outline-4">
<h4 id="iss-1777"><span class="section-number-4">2.1.24.</span> Issue #1777: Shallow copy in XSLT with maps and arrays</h4>
<div class="outline-text-4" id="text-iss-1777">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1777">issue 1777</a>
</p>

<ul class="org-ul">
<li>MK: In shallow-copy-mode, if you don’t write any template rules, the input is unchanged.
<ul class="org-ul">
<li>… You should be able to write templates that match individual items in the tree.</li>
<li>… It should behave as much like the same model with XNodes as possible.</li>
</ul></li>
</ul>

<p>
Next on the agenda, see below.
</p>
</div>
</div>
<div id="outline-container-iss-1234" class="outline-4">
<h4 id="iss-1234"><span class="section-number-4">2.1.25.</span> Issue #1234: Serialization Parameters: Indentation, Whitespace, Newlines</h4>
<div class="outline-text-4" id="text-iss-1234">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/1234">issue 1234</a>
</p>

<ul class="org-ul">
<li>JLO: I like it.</li>
<li>MK: We have extension attributes in Saxon to do this.
<ul class="org-ul">
<li>… We do indent attributes by default, but you can switch it off (by setting the line length)</li>
</ul></li>
<li>DB: I’d like <code>line-length</code> as well.</li>
<li>JLO: I’ve had several users requesting this.</li>
<li>MK: An option to reformat paragraphs would also be nice.</li>
<li>NW: Let’s leave aside the question “what is a paragraph!”</li>
<li>MK: Well, it’s clear in HTML.</li>
</ul>

<p>
We’ll wait to see if CG writes a PR.
</p>
</div>
</div>
<div id="outline-container-iss-675" class="outline-4">
<h4 id="iss-675"><span class="section-number-4">2.1.26.</span> Issue #675: XSLT streaming rules for new constructs</h4>
<div class="outline-text-4" id="text-iss-675">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/675:">issue 675:</a>
</p>

<p>
“Yes, we need them.”
</p>

<ul class="org-ul">
<li>MK: I’ve done some work on them, but they need reviewing.
<ul class="org-ul">
<li>… And there’s an enormous gap in testing.</li>
</ul></li>
</ul>

<p>
Some discussion of the philosophy of streaming.
</p>

<ul class="org-ul">
<li>MK: The demand for streaming is down (because hardware is bigger), but the
2^31 limit on Java and C# strings is becoming problematic. But that’s an
implementation problem.</li>
</ul>
</div>
</div>
<div id="outline-container-iss-285" class="outline-4">
<h4 id="iss-285"><span class="section-number-4">2.1.27.</span> Issue #285: Stability of collections</h4>
<div class="outline-text-4" id="text-iss-285">
<p>
See <a href="https://github.com/qt4cg/qtspecs/issues/285:">issue 285:</a>
</p>

<ul class="org-ul">
<li>MK: There’s another significant problem with stability: all these functions
now have options and if you read the same URI with different options, you
sometimes need to get back a different document.</li>
<li>NW: Is it time to consider abandoning the stability requirement altogether?</li>
<li>MK: Well, that’s a radical choice. Lots of users call “doc” inside a match
pattern, so that would be catastrophic.
<ul class="org-ul">
<li>… Saxon <code>fn:collection</code> has never been stable and no one has ever complained.</li>
</ul></li>
<li>JLO: Writing into a collection a database would make more documents appear.</li>
</ul>

<p>
Some discussion of hashing the options and doing stability with the URI + the options.
</p>

<ul class="org-ul">
<li>MK: That’s what we’re doing with the <code>fn:doc</code> function.
<ul class="org-ul">
<li>… Then there’s consistency: if you do <code>fn:doc</code> and <code>fn:unparsed-text</code> on the
same URI, do they have to be “consistent”?</li>
</ul></li>
<li>NW: It boils down to keeping the bag of bits you got from the first access.</li>

<li>MK: Stability for the <code>fn:doc</code> function has two aspects: has the underlying
resource changed, but also, you are guaranteeing node identity of the
document. That doesn’t apply to parsing JSON, or other sources.</li>
</ul>

<p>
We have the option on <code>fn:doc</code> to say whether or not you want guaranteed stability.
</p>

<p>
Leave open, still unresolved.
</p>
</div>
</div>
</div>
