meeting/minutes/2026/06-02.org
** JSON transformations
:PROPERTIES:
:CUSTOM_ID: json-transform
:END:

+ MK: I did a case study on this. I wrote it up in an issue as it progressed, [[https://github.com/qt4cg/qtspecs/issues/1786][#1786]].
  + … What I needed to test as a feasibility study was to take an application that users recursive JSON
  + … The example I came up with is the Java to C# transpiler; we use the Java
    parser to get a syntax tree, we do a transformation, and serialize the
    result as C#.
  + … The open source parser we use gives us XML. But what if it gave us JSON?
  + … I was testing how we’d have to change the transpiler if the syntax tree was JSON.
  + … That turned out to be a fairly useful exercise, but in some ways we were
    lucky because the XML it generates is slightly peculiar.
  + … The XML uses element names to identify the kind of objects in the AST.
  + … Consequently, the transformation in that case is totally based on the role
    attribute, not the element names.
  + … In JSON, you don’t have element names and the chances are the JSON you
    would get would represent the kind of construct and the role as JSON
    properties. That effects the feasibility of matching them.
+ MK: The other thing that was slightly unusual was that it didn’t need the
  ancestor access. Usually, there’s at least one place where you have to look at
  the context. But Java doesn’t have context dependencies like that.
+ MK: The lack of element names is the most signifcant thing that emerges;
  everything has to be driven by property values.
+ MK: What I’m struggling with now is, how do you put maps back together when
  you’re going up the tree after the transformation.
+ MK: I thought arrays would be difficult, but I think in practice users will do
  for-each constructs over arrays.
  + … You aren’t likely to have a template that matches an array-of-authors and
    another that matches an array-of-dimensions. You’re going to loop over the
    arrays where you know what they are.
+ MK: A recursive structure is usually done with maps; I imagine that a
  recursive array structure is very unusual.

Some discussion of the nature of JSON; we’re dealing with a hierarchal data structure. It’s
recursive in that sense.

+ MK: Recursive data structures are common in documents, but less common perhaps in data.

Some discussion of the dimensions of nested arrays. Usually a fixed dimension in strongly typed languages.

Consider this input:

#+BEGIN_SRC json
{
  "name": "europe",
  "type": "territory",
  "part": [ 
     { "name": "germany",
       "type": "country",
       "part": [
          { "name": "berlin", "type": "city", "population": 3800000 },
          { "name": "bonn", "type": "city", "population": 340000 }
       ]
     }
  ]
}
#+END_SRC

The CG did some whiteboarding exercises exploring various possible approaches.
Some of the syntax may be speculative.

Updating the population of each territory:

#+BEGIN_SRC xml
<xsl:template match="{'type': enum('territory')}">
  <xsl:variable name="result" as="map(*)">
    <xsl:apply-templates/>
  </xsl:variable>
  <xsl:sequence select="map:put($result, 'population', sum($result//population)"/>
</xsl:template>
#+END_SRC

Attempting to fix the capitalization of city names:

#+BEGIN_SRC xml
<xsl:template match="{'name'}[map:size(.) = 1]">
  <xsl:sequence select="map:put(., 'name', eg:fix-name-case(.?name))"/>
</xsl:template>
#+END_SRC

Increasing the population of each city by 10%:

#+BEGIN_SRC xml
<xsl:template match="{'population'}[map:size() = 1
                     and ../type = 'city']">
  <xsl:sequence select="map{'population', ../population*1.1}"/>
</xsl:template>
#+END_SRC

Sorting the cities by population:

#+BEGIN_SRC xml
<xsl:template match="array-of({'type':enum('city')})">
  <xsl:apply-templates>
    <xsl:sort select="?population"/>
  </xsl:apply-templates/>
</xsl:template>
#+END_SRC

Attempting to add a new property to each city:

#+BEGIN_SRC xml
<xsl:template match="j{'type': enum('city')}">
  <!-- add: area -->
  <xsl:map>
    <xsl:apply-templates/>
    <xsl:map-entry key="'area'" select="eg:area-of(?name)"/>
  </xsl:map>
</xsl:template>
#+END_SRC

Notes:

+ In shallow-copy mode, if apply-templates operates in the context of a map, it
  reconstructs a map from the result of applying templates
+ In shallow-copy mode, if apply-templates operates in the context of an array, it
  reconstructs an array from the result of applying templates
+ If apply-templates is operating on an array, sorting operates on the array elements


