meeting/minutes/2026/06-02.html
<div id="outline-container-json-transform" class="outline-3">
<h3 id="json-transform"><span class="section-number-3">2.2.</span> JSON transformations</h3>
<div class="outline-text-3" id="text-json-transform">
<ul class="org-ul">
<li>MK: I did a case study on this. I wrote it up in an issue as it progressed, <a href="https://github.com/qt4cg/qtspecs/issues/1786">#1786</a>.
<ul class="org-ul">
<li>… What I needed to test as a feasibility study was to take an application that users recursive JSON</li>
<li>… The example I came up with is the Java to C# transpiler; we use the Java
parser to get a syntax tree, we do a transformation, and serialize the
result as C#.</li>
<li>… The open source parser we use gives us XML. But what if it gave us JSON?</li>
<li>… I was testing how we’d have to change the transpiler if the syntax tree was JSON.</li>
<li>… That turned out to be a fairly useful exercise, but in some ways we were
lucky because the XML it generates is slightly peculiar.</li>
<li>… The XML uses element names to identify the kind of objects in the AST.</li>
<li>… Consequently, the transformation in that case is totally based on the role
attribute, not the element names.</li>
<li>… In JSON, you don’t have element names and the chances are the JSON you
would get would represent the kind of construct and the role as JSON
properties. That effects the feasibility of matching them.</li>
</ul></li>
<li>MK: The other thing that was slightly unusual was that it didn’t need the
ancestor access. Usually, there’s at least one place where you have to look at
the context. But Java doesn’t have context dependencies like that.</li>
<li>MK: The lack of element names is the most signifcant thing that emerges;
everything has to be driven by property values.</li>
<li>MK: What I’m struggling with now is, how do you put maps back together when
you’re going up the tree after the transformation.</li>
<li>MK: I thought arrays would be difficult, but I think in practice users will do
for-each constructs over arrays.
<ul class="org-ul">
<li>… You aren’t likely to have a template that matches an array-of-authors and
another that matches an array-of-dimensions. You’re going to loop over the
arrays where you know what they are.</li>
</ul></li>
<li>MK: A recursive structure is usually done with maps; I imagine that a
recursive array structure is very unusual.</li>
</ul>

<p>
Some discussion of the nature of JSON; we’re dealing with a hierarchal data structure. It’s
recursive in that sense.
</p>

<ul class="org-ul">
<li>MK: Recursive data structures are common in documents, but less common perhaps in data.</li>
</ul>

<p>
Some discussion of the dimensions of nested arrays. Usually a fixed dimension in strongly typed languages.
</p>

<p>
Consider this input:
</p>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #707183;">{</span>
  <span style="color: #bf360c;">"name"</span>: <span style="color: #6C3082;">"europe"</span>,
  <span style="color: #bf360c;">"type"</span>: <span style="color: #6C3082;">"territory"</span>,
  <span style="color: #bf360c;">"part"</span>: <span style="color: #7388d6;">[</span> 
     <span style="color: #909183;">{</span> <span style="color: #bf360c;">"name"</span>: <span style="color: #6C3082;">"germany"</span>,
       <span style="color: #bf360c;">"type"</span>: <span style="color: #6C3082;">"country"</span>,
       <span style="color: #bf360c;">"part"</span>: <span style="color: #709870;">[</span>
          <span style="color: #907373;">{</span> <span style="color: #bf360c;">"name"</span>: <span style="color: #6C3082;">"berlin"</span>, <span style="color: #bf360c;">"type"</span>: <span style="color: #6C3082;">"city"</span>, <span style="color: #bf360c;">"population"</span>: <span style="color: #0288D1;">3800000</span> <span style="color: #907373;">}</span>,
          <span style="color: #907373;">{</span> <span style="color: #bf360c;">"name"</span>: <span style="color: #6C3082;">"bonn"</span>, <span style="color: #bf360c;">"type"</span>: <span style="color: #6C3082;">"city"</span>, <span style="color: #bf360c;">"population"</span>: <span style="color: #0288D1;">340000</span> <span style="color: #907373;">}</span>
       <span style="color: #709870;">]</span>
     <span style="color: #909183;">}</span>
  <span style="color: #7388d6;">]</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
The CG did some whiteboarding exercises exploring various possible approaches.
Some of the syntax may be speculative.
</p>

<p>
Updating the population of each territory:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span> <span style="color: #455A64;">match</span>=<span style="color: #6C3082;">"{'type': enum('territory')}"</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">variable</span> <span style="color: #455A64;">name</span>=<span style="color: #6C3082;">"result"</span> <span style="color: #455A64;">as</span>=<span style="color: #6C3082;">"map(*)"</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
    <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">apply-templates</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">variable</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">sequence</span> <span style="color: #455A64;">select</span>=<span style="color: #6C3082;">"map:put($result, 'population', sum($result//population)"</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
<span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
</pre>
</div>

<p>
Attempting to fix the capitalization of city names:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span> <span style="color: #455A64;">match</span>=<span style="color: #6C3082;">"{'name'}[map:size(.) = 1]"</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">sequence</span> <span style="color: #455A64;">select</span>=<span style="color: #6C3082;">"map:put(., 'name', eg:fix-name-case(.?name))"</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
<span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
</pre>
</div>

<p>
Increasing the population of each city by 10%:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span> <span style="color: #455A64;">match</span>=<span style="color: #6C3082;">"{'population'}[map:size() = 1
                     and ../type = 'city']"</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">sequence</span> <span style="color: #455A64;">select</span>=<span style="color: #6C3082;">"map{'population', ../population*1.1}"</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
<span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
</pre>
</div>

<p>
Sorting the cities by population:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span> <span style="color: #455A64;">match</span>=<span style="color: #6C3082;">"array-of({'type':enum('city')})"</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">apply-templates</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
    <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">sort</span> <span style="color: #455A64;">select</span>=<span style="color: #6C3082;">"?population"</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">apply-templates</span><span style="color: #444444; background-color: #e1d9c2;">/&gt;
</span><span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
</pre>
</div>

<p>
Attempting to add a new property to each city:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span> <span style="color: #455A64;">match</span>=<span style="color: #6C3082;">"j{'type': enum('city')}"</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #795548;">&lt;!-- </span><span style="color: #795548;">add: area</span><span style="color: #795548;"> --&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">map</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
    <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">apply-templates</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
    <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">map-entry</span> <span style="color: #455A64;">key</span>=<span style="color: #6C3082;">"'area'"</span> <span style="color: #455A64;">select</span>=<span style="color: #6C3082;">"eg:area-of(?name)"</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
  <span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">map</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
<span style="color: #444444; background-color: #e1d9c2;">&lt;</span><span style="color: #444444; background-color: #e1d9c2;">/</span><span style="color: #795548;">xsl</span><span style="color: #444444; background-color: #e1d9c2;">:</span><span style="color: #388E3C;">template</span><span style="color: #444444; background-color: #e1d9c2;">&gt;</span>
</pre>
</div>

<p>
Notes:
</p>

<ul class="org-ul">
<li>In shallow-copy mode, if apply-templates operates in the context of a map, it
reconstructs a map from the result of applying templates</li>
<li>In shallow-copy mode, if apply-templates operates in the context of an array, it
reconstructs an array from the result of applying templates</li>
<li>If apply-templates is operating on an array, sorting operates on the array elements</li>
</ul>
</div>
</div>
