meeting/minutes/2026/06-02.org
** Trusted execution
:PROPERTIES:
:CUSTOM_ID: trusted-execution
:END:

Is the trusted execution model complete and sufficient?

+ MK: The real issue is transitive reference. You have to be able to ask for
  ~books.xml~, but what’s scary is when ~books.xml~ contains a reference to
  ~/etc/passwd~.
+ JLO: But I do want to be able to limit external access in general.
+ MK: When you do an ~fn:transform~ call, the question is, “do I trust the
  person who wrote the stylesheet I’m invoking”.
+ JLO: The spec should at least say what functions have potential external access.
+ MK: The classic billion laughs kind of vulnerability raises the question of
  whether you trust the document itself.
+ NW: The “available documents” question is what’s really important.
+ MK: For xsl:include and xsl:import, you’re in the domain of the compiler. Is
  there a security mode in the C-compiler that prevents  you from accessing resources.
+ NW: For ~fn:transform~, I might want to have different documents for different
  transforms.
+ MK: That would require the trust level being not a boolean but something like a domain name.

Some discussion of the context of ~xsl:use-package~; it’s static.

+ MK: There’s still a bit of a disconnect between the static concept notion of
  /available documents/ and the security model.

*** Where is “trusted” needed?
:PROPERTIES:
:CUSTOM_ID: h-230E9F5B-920C-47AC-AE46-92BB58E8A18C
:END:

+ Any function that accesses to an external resource
  + All of the file: functions, the fn:doc function and friends

** Publication scheduling
:PROPERTIES:
:CUSTOM_ID: pub-schedule
:END:

What are we going to publish, and when? How do we inform the broader community
when we think we’re ready for “last call” review? How do we manage the details
of final publication?

+ NW: We’re not a rec-track document, so there’s no official sequence.
  + … We can do “dated/frozen” specifications as effective “last call” drafts.
  + … Give users 60 days and iterate until done.
+ MK: What about logos and patent policy?
+ NW: That’s covered by the fact that we’re a W3C community group.
+ NW: Last call in 2026 seems…unlikely. We really must try to get to a last call status in 2027.
  + Proposal: get to last call by 1 March 2027?

ACTION QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard. It looks like we don’t need to meet on Wednesday. Next meeting: 16 June.
