meeting/minutes/2026/06-02.html
<div id="outline-container-trusted-execution" class="outline-3">
<h3 id="trusted-execution"><span class="section-number-3">2.3.</span> Trusted execution</h3>
<div class="outline-text-3" id="text-trusted-execution">
<p>
Is the trusted execution model complete and sufficient?
</p>

<ul class="org-ul">
<li>MK: The real issue is transitive reference. You have to be able to ask for
<code>books.xml</code>, but what’s scary is when <code>books.xml</code> contains a reference to
<code>/etc/passwd</code>.</li>
<li>JLO: But I do want to be able to limit external access in general.</li>
<li>MK: When you do an <code>fn:transform</code> call, the question is, “do I trust the
person who wrote the stylesheet I’m invoking”.</li>
<li>JLO: The spec should at least say what functions have potential external access.</li>
<li>MK: The classic billion laughs kind of vulnerability raises the question of
whether you trust the document itself.</li>
<li>NW: The “available documents” question is what’s really important.</li>
<li>MK: For xsl:include and xsl:import, you’re in the domain of the compiler. Is
there a security mode in the C-compiler that prevents  you from accessing resources.</li>
<li>NW: For <code>fn:transform</code>, I might want to have different documents for different
transforms.</li>
<li>MK: That would require the trust level being not a boolean but something like a domain name.</li>
</ul>

<p>
Some discussion of the context of <code>xsl:use-package</code>; it’s static.
</p>

<ul class="org-ul">
<li>MK: There’s still a bit of a disconnect between the static concept notion of
<i>available documents</i> and the security model.</li>
</ul>
</div>
<div id="outline-container-h-230E9F5B-920C-47AC-AE46-92BB58E8A18C" class="outline-4">
<h4 id="h-230E9F5B-920C-47AC-AE46-92BB58E8A18C"><span class="section-number-4">2.3.1.</span> Where is “trusted” needed?</h4>
<div class="outline-text-4" id="text-h-230E9F5B-920C-47AC-AE46-92BB58E8A18C">
<ul class="org-ul">
<li>Any function that accesses to an external resource
<ul class="org-ul">
<li>All of the file: functions, the fn:doc function and friends</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-pub-schedule" class="outline-3">
<h3 id="pub-schedule"><span class="section-number-3">2.4.</span> Publication scheduling</h3>
<div class="outline-text-3" id="text-pub-schedule">
<p>
What are we going to publish, and when? How do we inform the broader community
when we think we’re ready for “last call” review? How do we manage the details
of final publication?
</p>

<ul class="org-ul">
<li>NW: We’re not a rec-track document, so there’s no official sequence.
<ul class="org-ul">
<li>… We can do “dated/frozen” specifications as effective “last call” drafts.</li>
<li>… Give users 60 days and iterate until done.</li>
</ul></li>
<li>MK: What about logos and patent policy?</li>
<li>NW: That’s covered by the fact that we’re a W3C community group.</li>
<li>NW: Last call in 2026 seems…unlikely. We really must try to get to a last call status in 2027.
<ul class="org-ul">
<li>Proposal: get to last call by 1 March 2027?</li>
</ul></li>
</ul>

<p>
ACTION QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard. It looks like we don’t need to meet on Wednesday. Next meeting: 16 June.
</p>
</div>
</div>
</div>
</body>
</html>
